jack77er/openUTRUSTA/Packages/.cache/Keil.STM32L0xx_DFP.1.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32L0xx_DFP</name>
  <description>STMicroelectronics STM32L0 Series Device Support and Examples</description>

  <releases>
    <release version="1.4.0" date="2015-11-11">
      Added subfamilies STM32L011/21, STM32L031/41, STM32L071/72/73, STM32L081/82/83.
      Added Option Byte (OPT), EEPROM Flash Algorithm.
      Updated STM32L0xx device support files.
      Updated user manuals, datasheets.
      Updated RTX Blinky examples.
    </release>
    <release version="1.3.0" date="2015-02-23">
      Added Board Support for STM32L053-Discovery board.
    </release>
    <release version="1.2.0" date="2014-11-18">
      Reworked STM32L0xx Flash Programming Algorithm to improve programming speed.
    </release>
    <release version="1.1.0" date="2014-09-30">
      Added devices STM32L051T6, STM32L051T8, STM32L052T6, STM32L052T8.
      Added SVD files.
      Updated documentation.
      Removed ST-Link Add-On installer from PACK
    </release>
    <release version="1.0.0">
      First Release version of STM32L0 Device Family Pack.
    </release>
  </releases>

  <devices>

    <family Dfamily="STM32L0 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <description>
The STM32L0 devices provides high power efficiency for a wide range of performance. It is achieved with a large choice of internal and external clock sources, an internal voltage adaptation and several low-power modes.
Typical applications include application control and user interfaces, handheld equipment, A/V receivers and digital TV, PC peripherals, gaming and GPS platforms, industrial applications, PLCs, inverters, printers, scanners, alarm systems, video intercoms, and HVACs

  - CRC calculation unit, 96-bit unique ID
  - USB 2.0 crystal-less, battery charging detection and LPM
  - True RNG and firewall protection
      </description>

      <feature type="Other"         n="1"                           name="20-byte backup register"/>
      <feature type="RNG"           n="1"                           name="True Random Number Generator"/>
      <feature type="Other"         n="1"/>
      <feature type="MemoryOther"   n="1"                           name="2048 Bytes EEPROM"/>
      <feature type="DMA"           n="7"/>
      <feature type="Timer"         n="5"       m="16"/>
      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="USART"         n="3"       m="4000000"/>
      <feature type="I2C"           n="2"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="VCC"           n="1.65"    m="3.60"/>

      <!-- ************************  Subfamily 'STM32L011'  **************************** -->
      <subFamily DsubFamily="STM32L011">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L011xx"/>
        <debug svd="SVD/STM32L0x1.svd"/>
        <algorithm name="Flash/STM32L01_2x_EEPROM.FLM" start="0x08080000" size="0x00000200" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>

        <!-- *************************  Device 'STM32L011G2'  ***************************** -->
        <device Dname="STM32L011G3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L011K2'  ***************************** -->
        <device Dname="STM32L011K3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L011F2'  ***************************** -->
        <device Dname="STM32L011F3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L011D2'  ***************************** -->
        <device Dname="STM32L011D3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L011G4'  ***************************** -->
        <device Dname="STM32L011G4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

