jack77er/openUTRUSTA/Packages/.cache/Keil.STM32L0xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32L031G4'  ***************************** -->
        <device Dname="STM32L031G4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'STM32L031K4'  ***************************** -->
        <device Dname="STM32L031K4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
        </device>

        <!-- *************************  Device 'STM32L031P4'  ***************************** -->
        <device Dname="STM32L031P4">
          <memory id="IROM1"                        start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L041'  **************************** -->
      <subFamily DsubFamily="STM32L041">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L041xx"/>
        <debug svd="SVD/STM32L0x1.svd"/>
        <algorithm name="Flash/STM32L03_4x_EEPROM.FLM" start="0x08080000" size="0x00000400" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>

        <!-- *************************  Device 'STM32L041C6'  ***************************** -->
        <device Dname="STM32L041C6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'STM32L041K6'  ***************************** -->
        <device Dname="STM32L041K6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'STM32L041P6'  ***************************** -->
        <device Dname="STM32L041P6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'STM32L041G6'  ***************************** -->
        <device Dname="STM32L041G6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L051'  **************************** -->
      <subFamily DsubFamily="STM32L051">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L051xx"/>
        <debug svd="SVD/STM32L051x.svd"/>
        <algorithm name="Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>

        <feature type="SPI"           n="2"       m="16000000"/>

        <!-- *************************  Device 'STM32L051C6'  ***************************** -->
        <device Dname="STM32L051C6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L051C8'  ***************************** -->
        <device Dname="STM32L051C8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L051K6'  ***************************** -->
        <device Dname="STM32L051K6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="QFP"           n="32"/>
        </device>

