jack77er/openUTRUSTA/Packages/.cache/Keil.STM32L0xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32L051K8'  ***************************** -->
        <device Dname="STM32L051K8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="32"/>
        </device>

        <!-- *************************  Device 'STM32L051R6'  ***************************** -->
        <device Dname="STM32L051R6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L051R8'  ***************************** -->
        <device Dname="STM32L051R8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L051T6'  ***************************** -->
        <device Dname="STM32L051T6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="QFP"           n="36"/>
        </device>

        <!-- *************************  Device 'STM32L051T8'  ***************************** -->
        <device Dname="STM32L051T8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00108219.pdf" title="STM32L051xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="Temp"          n="-40"     m="105"/>
          <feature type="QFP"           n="36"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L052'  **************************** -->
      <subFamily DsubFamily="STM32L052">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L052xx"/>
        <debug svd="SVD/STM32L052x.svd"/>
        <algorithm name="Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108281.pdf" title="STM32L0x2 Reference Manual"/>

        <feature type="Touch"         n="24"                          name="Capacitive sensing channels supporting touchkey, linear and rotary touch sensors"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="USBD"          n="1"                           name="USB 2.0 crystal-less, battery charging detection and LPM"/>
        <feature type="SPI"           n="2"       m="16000000"/>

        <!-- *************************  Device 'STM32L052C6'  ***************************** -->
        <device Dname="STM32L052C6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <book name="Documents/DM00108217.pdf" title="STM32L052xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L052C8'  ***************************** -->
        <device Dname="STM32L052C8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00108217.pdf" title="STM32L052xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L052K6'  ***************************** -->
        <device Dname="STM32L052K6">
          <memory id="IROM1"                        start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <book name="Documents/DM00108217.pdf" title="STM32L052xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="QFP"           n="32"/>
        </device>

        <!-- *************************  Device 'STM32L052K8'  ***************************** -->
        <device Dname="STM32L052K8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00108217.pdf" title="STM32L052xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="QFP"           n="32"/>
        </device>

