jack77er/openUTRUSTA/Packages/.cache/Keil.STM32L0xx_DFP.1.4.0.pdsc
      <!-- ************************  Subfamily 'STM32L062'  **************************** -->
      <subFamily DsubFamily="STM32L062">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L062xx"/>
        <debug svd="SVD/STM32L062x.svd"/>
        <algorithm name="Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108281.pdf" title="STM32L0x2 Reference Manual"/>

        <!-- *************************  Device 'STM32L062K8'  ***************************** -->
        <device Dname="STM32L062K8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00108218.pdf" title="STM32L062K8 Data Sheet"/>

          <feature type="Touch"         n="24"                          name="Capacitive sensing channels supporting touchkey, linear and rotary touch sensors"/>
          <feature type="Crypto"        n="1"                           name="Hardware Encryption Engine AES 128-bit"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="USBD"          n="1"                           name="USB 2.0 crystal-less, battery charging detection and LPM"/>
          <feature type="I2S"           n="2"/>
          <feature type="QFP"           n="32"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L063'  **************************** -->
      <subFamily DsubFamily="STM32L063">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L063xx"/>
        <debug svd="SVD/STM32L063x.svd"/>
        <algorithm name="Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00095744.pdf" title="STM32L0x3 Reference Manual"/>

        <feature type="Touch"         n="24"                          name="Capacitive sensing channels supporting touchkey, linear and rotary touch sensors"/>
        <feature type="Crypto"        n="1"                           name="Hardware Encryption Engine AES 128-bit"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
        <feature type="USBD"          n="1"                           name="USB 2.0 crystal-less, battery charging detection and LPM"/>
        <feature type="SPI"           n="2"       m="16000000"/>

        <!-- *************************  Device 'STM32L063C8'  ***************************** -->
        <device Dname="STM32L063C8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00102435.pdf" title="STM32L063xx Data Sheet"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.18"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L063R8'  ***************************** -->
        <device Dname="STM32L063R8">
          <memory id="IROM1"                        start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <book name="Documents/DM00102435.pdf" title="STM32L063xx Data Sheet"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.31"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="QFP"           n="64"/>
          <feature type="BGA"           n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L071'  **************************** -->
      <subFamily DsubFamily="STM32L071">
        <processor Dclock="32000000"/>
        <compile header="Device/Include/stm32l0xx.h" define="STM32L071xx"/>
        <debug svd="SVD/STM32L0x1.svd"/>
        <algorithm name="Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documents/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>

        <!-- *************************  Device 'STM32L071C8'  ***************************** -->
        <device Dname="STM32L071C8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L071V8'  ***************************** -->
        <device Dname="STM32L071V8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L071K8'  ***************************** -->
        <device Dname="STM32L071K8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L071VB'  ***************************** -->
        <device Dname="STM32L071VB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L071RB'  ***************************** -->
        <device Dname="STM32L071RB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L071CB'  ***************************** -->
        <device Dname="STM32L071CB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

