jack77er/openUTRUSTA/Packages/.cache/Keil.STM32L0xx_DFP.1.4.0.pdsc
        <!-- *************************  Device 'STM32L083CB'  ***************************** -->
        <device Dname="STM32L083CB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L083VB'  ***************************** -->
        <device Dname="STM32L083VB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L083RB'  ***************************** -->
        <device Dname="STM32L083RB">
          <memory id="IROM1"                             start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L083CZ'  ***************************** -->
        <device Dname="STM32L083CZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L083KZ'  ***************************** -->
        <device Dname="STM32L083KZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L083VZ'  ***************************** -->
        <device Dname="STM32L083VZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>

        <!-- *************************  Device 'STM32L083RZ'  ***************************** -->
        <device Dname="STM32L083RZ">
          <memory id="IROM1"                             start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                             start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L011">
      <description>STMicroelectronics STM32L011 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L011*"/>
    </condition>
    <condition id="STM32L021">
      <description>STMicroelectronics STM32L021 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L021*"/>
    </condition>
    <condition id="STM32L031">
      <description>STMicroelectronics STM32L031 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L031*"/>
    </condition>
    <condition id="STM32L041">
      <description>STMicroelectronics STM32L041 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L041*"/>
    </condition>
    <condition id="STM32L051">
      <description>STMicroelectronics STM32L051 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L051*"/>
    </condition>
    <condition id="STM32L052">
      <description>STMicroelectronics STM32L052 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L052*"/>
    </condition>
    <condition id="STM32L053">
      <description>STMicroelectronics STM32L053 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L053*"/>
    </condition>
    <!--condition id="STM32L061">
      <description>STMicroelectronics STM32L061 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L061*"/>
    </condition-->
    <condition id="STM32L062">
      <description>STMicroelectronics STM32L062 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L062*"/>
    </condition>
    <condition id="STM32L063">
      <description>STMicroelectronics STM32L063 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L063*"/>
    </condition>
    <condition id="STM32L071">
      <description>STMicroelectronics STM32L071 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L071*"/>
    </condition>
    <condition id="STM32L072">
      <description>STMicroelectronics STM32L072 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L072*"/>
    </condition>
