jack77er/openUTRUSTA/Packages/.cache/Keil.STM32L0xx_DFP.1.4.0.pdsc
    <condition id="STM32L073">
      <description>STMicroelectronics STM32L073 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L073*"/>
    </condition>
    <condition id="STM32L081">
      <description>STMicroelectronics STM32L081 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L081*"/>
    </condition>
    <condition id="STM32L082">
      <description>STMicroelectronics STM32L082 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L082*"/>
    </condition>
    <condition id="STM32L083">
      <description>STMicroelectronics STM32L083 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L083*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L011 CMSIS">
      <description>STMicroelectronics STM32L011 Devices and CMSIS-Core</description>
      <require condition="STM32L011"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L021 CMSIS">
      <description>STMicroelectronics STM32L021 Devices and CMSIS-Core</description>
      <require condition="STM32L021"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L031 CMSIS">
      <description>STMicroelectronics STM32L031 Devices and CMSIS-Core</description>
      <require condition="STM32L031"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L041 CMSIS">
      <description>STMicroelectronics STM32L041 Devices and CMSIS-Core</description>
      <require condition="STM32L041"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L051 CMSIS">
      <description>STMicroelectronics STM32L051 Devices and CMSIS-Core</description>
      <require condition="STM32L051"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L052 CMSIS">
      <description>STMicroelectronics STM32L052 Devices and CMSIS-Core</description>
      <require condition="STM32L052"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L053 CMSIS">
      <description>STMicroelectronics STM32L053 Devices and CMSIS-Core</description>
      <require condition="STM32L053"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!--condition id="STM32L061 CMSIS">
      <description>STMicroelectronics STM32L061 Devices and CMSIS-Core</description>
      <require condition="STM32L061"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition-->
    <condition id="STM32L062 CMSIS">
      <description>STMicroelectronics STM32L062 Devices and CMSIS-Core</description>
      <require condition="STM32L062"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L063 CMSIS">
      <description>STMicroelectronics STM32L063 Devices and CMSIS-Core</description>
      <require condition="STM32L063"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L071 CMSIS">
      <description>STMicroelectronics STM32L071 Devices and CMSIS-Core</description>
      <require condition="STM32L071"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L072 CMSIS">
      <description>STMicroelectronics STM32L072 Devices and CMSIS-Core</description>
      <require condition="STM32L072"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L073 CMSIS">
      <description>STMicroelectronics STM32L073 Devices and CMSIS-Core</description>
      <require condition="STM32L073"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L081 CMSIS">
      <description>STMicroelectronics STM32L081 Devices and CMSIS-Core</description>
      <require condition="STM32L081"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L082 CMSIS">
      <description>STMicroelectronics STM32L082 Devices and CMSIS-Core</description>
      <require condition="STM32L082"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L083 CMSIS">
      <description>STMicroelectronics STM32L083 Devices and CMSIS-Core</description>
      <require condition="STM32L083"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup STM32L011 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L011 CMSIS">
      <description>System Startup for STMicroelectronics STM32L011 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l011xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L021 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L021 CMSIS">
      <description>System Startup for STMicroelectronics STM32L021 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l021xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L031 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L031 CMSIS">
      <description>System Startup for STMicroelectronics STM32L031 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l031xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

    <!-- Startup STM32L041 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="STM32L041 CMSIS">
      <description>System Startup for STMicroelectronics STM32L041 Devices</description>
      <files>
        <file category="include"  name="Device/Include/"/>
        <file category="source"   name="Device/Source/ARM/startup_stm32l041xx.s" attr="config"   version="1.4.0" condition="Compiler ARMCC"/>
        <file category="source"   name="Device/Source/system_stm32l0xx.c"        attr="config"   version="1.4.0"/>
        <file category="source"   name="Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
      </files>
    </component>

